// Task:
//      1. Заповнити квадратну матрицю випадковими числами.
//      2. Відобразити верхню половину матриці на нижню дзеркально симетрично відносно горизонтальної осі.
//      3. Вирішити обрану за варіантом задачу, не використовуючи паралелізацію. Заміряти час вирішення задачі,
//         або інші параметри, котрі студент вважає релевантними.
//      4. Вирішити оборану за варіантом задачу, використовуючи паралелізацію. Заміряти час вирішення задачі,
//         або інші параметри, котрі студент вважає релевантними. Обґрунтувати вибір алгоритму паралелізації
//         (розподілення даних між потоками), надати опис та обґрунтування в протоколі роботи.
//      5. Перевірити алгоритм на фіксованих кількостях потоків:
//          • 2-рази меншій, ніж кількість фізичних ядер;
//          • На кількості рівній фізичним ядрам;
//          • На кількості рівній логічних ядрам;
//          • На кількості більшій в 2, 4, 8, 16 разів ніж кількість логічних ядер.
//      6. Повторити пункт 5 з використанням різної розмірності даних.
//      7. Зробити таблиці та графіки залежності часу виконання завдання від кількості потоків для різної розмірності даних.
//         Надати опис графіків, з причинами виникнення отриманих результатів в протоколі роботи.

#include <iostream>
#include <thread>
#include <chrono>
#include <vector>
#include <cstdlib>
#include <ctime> 

using namespace std;

using chrono::nanoseconds;
using chrono::duration_cast;
using chrono::high_resolution_clock;

int main()
{
    srand(time(0));

    cout << "Hello World!\n";

    return 0;
}
